  # Домашняя работа 2
print("Denis dz  20.04")
print (2**5)
a = 32
b = 10
print(a+b)
c = 42
d = 3
print(c*d)
e = 126
f = -15
result = e-f
print(e, "-", f, "=", result)

# Домашняя работа 3 от 26.04.2025 Спросите у пользователя:
  # ● Его имя.
  # ● Его возраст.
  # ● Любит ли он программировать (ответ "да" или
  # "нет").
print("Как тебя зовут")
name = input()
print('Привет,', name)
print('Сколько тебе лет?')
age =input()
print('Ты любишь программирование да / нет?')
user_input = input('Ты любишь программирование (да / нет): ')
if user_input.lower() == 'yes':
    print('user typed yes')

    #Задание 2:
Пользователь вводит x, y. Программа выводит результат
математического выражения с результатом True или
False
# Выражение: (y>x-2)
# ввод значения от пользователя и перобразование в целое число
# x = int(input("Введите первое число: "))
# y = int(input("Введите второе число: "))
# print("x =", x) # вывод переменной x
# print("y =", y) # вывод переменной y



